
import java.util.Vector;

public class Goods {

	private Vector rows2 = new Vector();
	private Vector cols2 = new Vector();

	public Vector getRows2() {
		return rows2;
	}

	public void setRows2(Vector rows2) {
		this.rows2 = rows2;
	}

	public Vector getCols2() {
		return cols2;
	}

	public void setCols2(Vector cols2) {
		this.cols2 = cols2;
	}

	public Goods() {
		{
			cols2.add("编号");
			cols2.add("名称");
			cols2.add("条形码");
			cols2.add("价格");
			cols2.add("数量");
			cols2.add("位置");
			cols2.add("类型");
		}

		{
String[][] str={
		{"1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25"},
		{"铁灰色产品", "亮灰色产品", "黄色产品", "奶油色产品", "猩红色产品", "白烟色产品", "柠檬绿色产品", "卡其色产品", "铜色产品", "热带橙产品", "杏黄产品", "庚斯博罗灰产品", "暗灰产品", "卡其色产品", "栗色产品", "巧克力色产品", "雾玫瑰色产品", "砖红色产品", "热带橙产品", "砖红色产品", "芥末黃产品", "朱红色产品", "橄榄色产品", "昏灰产品", "咖啡色产品"},
		{"563287486664996346", "695667203708682244", "378809577516374280", "009507381448698798", "281611154549199323", "057418516914606332", "706019575332332100", "911039043523665085", "536905601091015907", "543307279285653547", "084243594779492174", "939392993426974289", "810466389406474673", "612012585347552592", "989841148770281359", "219797075310180566", "041556994937998476", "040728550357943427", "479382175087746985", "275754979006748864", "689810114946236439", "507132920313857648", "073530001654934691", "036489906260579122", "929386405108905031"},
		{"84.8", "71.4", "49.8", "87.3", "94.7", "75.5", "98.4", "79.4", "59.2", "82.7", "22.6", "70.6", "24.6", "1.6", "18.1", "16.2", "51.8", "38.3", "3.7", "36.5", "4.0", "27.2", "10.5", "54.5", "94.9"},
		{"269", "242", "198", "274", "289", "250", "297", "258", "218", "265", "144", "241", "148", "101", "135", "131", "203", "175", "105", "172", "106", "153", "119", "208", "290"},
		{"B2", "A1", "B3", "B2", "C1", "B1", "B2", "A3", "A1", "B2", "B1", "A2", "B3", "A3", "C1", "C1", "A2", "C1", "B2", "C1", "B1", "A2", "A1", "A2", "A3"},
		{"酒水", "日用品", "饮料", "保健品", "副食品", "酒水", "副食品", "食品", "食品", "日用品", "副食品", "日用品", "其他", "饮料", "食品", "酒水", "副食品", "保健品", "日用品", "酒水", "饮料", "保健品", "食品", "文具", "保健品"}
};







			Vector[] v=new Vector[25];
			for (int i = 0; i < v.length; i++) {
				v[i]=new Vector();
				v[i].add(str[0][i]);
				v[i].add(str[1][i]);
				v[i].add(str[2][i]);
				v[i].add(str[3][i]);
				v[i].add(str[4][i]);
				v[i].add(str[5][i]);
				v[i].add(str[6][i]);
				rows2.add(v[i]);
			}

		}

	}
}
